{
    "id": "CHQ-0730758",
    "label": "Agile Coach",
    "parts": [
        {
            "data": "Job description We are seeking an experienced Agile Team Coach who will drive Agile principles and practices into the IBM organization. This role works with teams who want to implement and improve Agile practices specific to software development, as well as drive overall Agile culture change. Agile coaches work closely with teams and team members (e.g., Scrum Masters) to develop and perform activities allowing the development of Agile skills and improvement of development processes. The role of the team coach is to share their experience and observations with all team members and to make sure that the best practices are being used. The objective of the team coach is to help teams develop their Agile skills in order to rapidly become self-sufficient and benefit from Agile approaches. More specifically, the team coach supports the start-up of teams/projects, gives advice to improve the application of Scrum throughout projects, and spreads the best practices. This coach promotes and facilitates in a cohesive manner the adoption of Agility within teams and by organizations.Agile coaches bring their knowledge of Agility. They work with other coaches who have the same challenges and who seek gaining experience in order to better coach teams. Agile coaches are passionate about communication, group dynamics and coaching and are not afraid to raise issues and drive change to remove impediments to adoption. An Agile Coach should have an insatiable appetite for learning new things and improving existing ones.Tasks and Responsibilities:Define the Agile approach, principles and practices Carry out Agile coaching Help teams implement Agile development approaches Coach Scrum Masters to help them familiarize with their role Remain at the leading-edge of Agile development practices and contribute to their spreading across the organization Understand the mechanisms of Agile practices and software development processes and able to clearly communicate to others Work to help all levels of the organization understand the benefits of working agile Candidates must be within commuting distance, or available to relocate, to Austin, TX; Raleigh, NC; or Somers, NY. Required Bachelor's Degree At least 3 years experience in Agile Project Management At least 2 years experience in working on an Agile team Readiness to travel 10% travel annually English: Fluent Preferred At least 5 years experience in Agile Project Management At least 5 years experience in working on an Agile team At least 3 years experience in coaching and facilitation",
            "name": "Job description",
            "type": "text"
        }
    ]
}