{
    "id": "GBS-0726663",
    "label": "Insurance Industry Associate Partner - IBM Interactive Experience & Mobile",
    "parts": [
        {
            "data": "IBM Interactive Experience and Mobile (IX&M) integrates strategy, data and design to create transformative experiences fusing the physical and digital worlds to help organizations grow. The IBM IX&M team is currently seeking an Associate Partner with customer engagement and marketing platform experience, as well as experience in the Financial Services industry (Banking, Insurance, and/or Financial Markets). This Associate Partner will have subject matter expertise in several of the following technology capabilities: Customer experience strategy and design Customer engagement lifecycle process design Cloud-based and On-premises marketing platform solutions eCommerce strategy and/or platforms Designing, developing, and deploying customer engagement platforms Tracking This dynamic Associate Partner role involves the following: Sales & Proposal Management: Establish project vision and objectives with the client. Lead the proposal team through the development of project scope and approach to solution the client's issue. Understand and abides by quality assurance guidelines. Draft and review responses to Requests for Information (RFI), responses to Requests for Proposal (RFP), IBM contracts, and IBM Statements of Work. Project Delivery Tasks: Perform quality review of major project deliverables. Lead work sessions and deliverable presentations with client CXO members. Identify and secures new and follow on work. Knowledge Management: Ensure the use and collection of intellectual capital on the engagement. People Management: Mentor junior consultants, engagement managers and other relatively junior delivery consultants on the proposal and/or delivery teams as appropriate. Relationship Management: Sell consulting engagements to CXO level clients. Develop relationships with client executives at the CXO level. Leverage strong executive presence and demonstrate the ability to establish credibility in the first client meeting. Competency: Recognized as an expert in their competency and/or specific offerings. Capable of developing and crafting trends and client implications within the marketing and customer engagement. iX&M Community: Participate in and/or is responsible for the creation, harvesting, protection and reuse of IBM's intellectual capital. Participate actively in/lead knowledge sharing activities like communities of practice, forums, conferences and/or other knowledge exchanges. IBM Global Business Services helps leaders transform their businesses with dedicated expertise in eighteen industries. Around the world, IBMers’ expertise in advanced research, analytics and technology helps clients envision the future and succeed. It’s exciting work to innovate with others and make the world work better—and a great opportunity for you. At IBM, you’ll help us make markets by transforming industries and professions with data. You’ll work to remake enterprise IT for the era of cloud. You’ll enable “systems of engagement”for enterprises, and you’ll lead by example. Don’t join a consulting firm, join IBM. Learn more about IBM Interactive Experience: http://www-935.ibm.com/services/us/gbs/interactive/ 2252 (4687) Required Bachelor's Degree At least 5 years experience in solutioning and leading multiple projects across geographies and acting as a professional advisor to project teams. At least 5 years experience in delivering complex platform transformation projects installing components or multiple components of a customer engagement platform At least 3 years experience in leading distributed teams across business and technology functions to design, delivery, and deploy new business processes and complex technologies At least 3 years experience in demonstrating the successful ability to integrate into a complex matrix based organization At least 3 years experience in demonstrating the ability to solution, sell, and deliver complex engagements. At least 5 years experience in the Financial Services Sector: Banking, Insurance and/or Financial Markets. At least 5 years experience in understanding marketing platforms (IBM + non-IBM); and understanding key Cloud and On-Premises systems Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Basic knowledge Preferred Master's Degree At least 10 years experience in solutioning and leading multiple projects across geographies and acting as a professional advisor to project teams. At least 7 years experience in delivering complex platform transformation projects installing components or multiple components of a customer engagement platform At least 5 years experience in leading distributed teams across business and technology functions to design, delivery, and deploy new business processes and complex technologies At least 5 years experience in demonstrating the successful ability to integrate into a complex matrix based organization At least 5 years experience in demonstrating the ability to solution, sell, and deliver complex engagements. At least 7 years experience in the Financial Services Sector: Banking, Insurance and/or Financial Markets. At least 7 years experience in understanding marketing platforms (IBM + non-IBM); and understanding key Cloud and On-Premises systems English : Intermediate ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
