{
    "id": "GBS-0731263",
    "label": "Lead Master Data Management (MDM) Developer - Business Analytics & Strategy",
    "parts": [
        {
            "data": "The Business Analytics & Strategy (BA&S) Lead Master Data Management (MDM) Developer is responsible for successful delivery of MDM solutions and services in a client consulting environment, and is an experienced MDM developer.The Lead MDM Developer: Provides overall MDM tool leadership during the design and build of MDM solution components Acts as primary point of contact for MDM related issues and inquiries Leads the design and development of customized MDM code Designs and develops customized MDM services Designs and develops necessary batch interfaces to and from MDM hub Integrates interfaces to MDM tool Conducts Quality Assurance (QA) code reviews on all MDM components Conducts Regression Testing of new releases of software components within the MDM repository Conducts Regression, Functional, and Baseline Testing of future schedule releases Conducts Regression, Functional, and Baseline Testing of new releases of MDM software Your future, made with IBM We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming industries, society and even the workplace—by creating professions that didn’t exist before the emergence of data, cloud, social and mobile. IBM Global Business Services is a leader in this worldwide transformation and just the place to define and develop your consulting career. Whether it’s business consulting, sales, project management or a technical path, you’ll have the opportunity to make an impact on the world by working to solve some of society’s most complex problems with your original thinking and ideas. As an IBMer, you’ll innovate in pursuit of higher value in everything you do, all while being guided by IBM’s purpose—to be essential. Essential in your leadership and dedication to building valuable client relationships with groundbreaking work. Essential in uncovering what’s possible and helping global clients succeed. Join us as we make the most of these exciting times and discover what you can make of this moment. What will you make with IBM? ibm.com/jobs Required Bachelor's Degree At least 2 years experience in hands-on implementation of Master Data Management (MDM) solutions  At least 2 years experience in hands-on usage of MDM tools (IBM InfoSphere MDM or Informatica MDM) At least 2 years experience in large and complex data management projects At least 2 years experience in delivering IT Services and/or Consulting projects within a consulting organization At least 1 year experience in Rapid Application Development (RAD) At least 1 year experience in SQL At least 1 year experience in Java/J2EE development Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Intermediate Preferred Master's Degree At least 5 years experience in hands-on implementation of Master Data Management (MDM) solutions At least 5 years experience in hands-on usage of MDM tools (IBM InfoSphere MDM or Informatica MDM) At least 5 years experience in large and complex data management projects At least 5 years experience in delivering IT Services and/or Consulting projects within a consulting organization At least 3 years experience in Rapid Application Development (RAD) At least 3 years experience in SQL At least 3 years experience in Java/J2EE development At least 3 years experience in MQ knowledge English : Fluent",
            "name": "Job description",
            "type": "text"
        }
    ]
}