{
    "id": "GBS-0731907",
    "label": "Demand Planning Regional Analyst ",
    "parts": [
        {
            "data": "This project will consolidate the procurement and assistance components of the current Deliver and Supply Chain Management System (SCMS), also known as President's Emergency Plan for AIDS Relief (PEPFAR), programs and will be the primary vehicle through which the government will procure and provide health commodities to partner countries and provide assistance to improve countries’ management of the supply chains for such commodities. To support global health initiatives in HIV/AIDS, malaria, maternal and child health, and reproductive health, the project has three primary objectives: global commodity procurement and logistics, systems strengthening to support in-country supply chain management, and collaboration via strategic engagement to improve long-term global supply of health commodities. The Demand Planning Regional Analyst designs analytics solutions and services in the area of optimization (linear mixed integer constraint programming), simulation, and/or predictive analytics. The Analyst will be responsible for formulating mathematical approaches to solve complex demand planning problems, gathering of data to solve those problems, and developing analyzing/drawing conclusions. The Demand Planning Regional Analyst will be responsible for · Demand planning functions specifically aggregating analyzing and defining global demand forecasts in order to optimize supply chain decisions and quantify and qualify regional future requirements · Design of analytics solutions and services in optimization, simulation and/or predictive analytics · Skills required include mathematical optimization discrete-event simulation and predictive analytics · Support the development of Demand Planning reports and presentations reporting to the Demand Plan Team Manager · Use of a blend of historical demand analytics, forecasting methods and insights at the country level to build demand plans that provide the basis for financial budgets inventory plans, warehouse plans, transportation design and sourcing negotiations · Drafting reports, briefs, talking points, peer-reviewed publications, and oral presentations to a diverse, external audience, including: policy makers, academics, and other government organizations In addition, the Demand Planning Regional Analyst will be responsible for · Building knowledge of select markets in the medium to long term to estimate global health demands relative to the program · Demand planning experience in healthcare commodities supporting Africa, Asia and Latin America a plus · Identifying and modeling the impact of potential activity in the pharmaceutical market related to this program · Other activities as necessary in support of demand planning and program communications relative to the market Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities. IBM Global Business Services: Join a Leader. Consult with us. (2252) Required Bachelor's Degree At least 2 years experience in Demand Planning Basic knowledge in key organizations working in the area of Global Health Basic knowledge in ILOG CPlex, SAS or SPSS Basic knowledge in analytical, problem solving, and quantitative modeling skills, plus affinity for analytics and information management Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Basic knowledge Preferred Master's Degree Basic knowledge in working with developing countries Basic knowledge in planning experience for healthcare commodities in a global environment as well as demand analysis experience augmenting spend and market analysis in order to contribute to optimal inventory Basic knowledge in conducting demand spend and market analyses for global health care commodity groups Basic knowledge in working with key organizations in the area of HIV/AIDS, tuberculosis and malaria with a focus on prevention, diagnosis and treatment Basic knowledge in collection, analysis and use of market information on pharmaceutical supply chains and/or program management for global public health programs Basic knowledge in mathematical optimization or predictive analytics English : Intermediate Additional information To be an official applicant to IBM, you must submit a resume and online application. Resumes submitted remain active for six months. To all recruitment agencies: IBM only accepts resumes from agencies on our Approved Agency List. Please do not forward resumes to our applicant tracking system, IBM employees, or send to any IBM company location. IBM is not responsible for any fees related to unsolicited resumes. IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
