{
    "id": "GBS-0731902",
    "label": "Senior Hadoop Developer ",
    "parts": [
        {
            "data": "The Senior Hadoop Developer will be responsible for developing Application Program Interfaces (APIs) and Services as needed in Java. In addition, the Senior Hadoop Developer will work with teams to configure and adapt the correlation algorithm which works against data in HBase, analyze system performance, make recommendations to improve performance, and implement those recommendations once approved. Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities. IBM Global Business Services: Join a Leader. Consult with us. (2252) DCHJ Required High School Diploma/GED At least 1 year experience in HBase and HBase Code development At least 3 years experience in developing code in Java and scripting languages Basic knowledge in Java Virtual Machine (JVM) Languages including, but not limited to Java Basic knowledge in JVM Technologies, Reflection, Spring, Web Application development, Apache Commons Libraries At least 3 years experience in No-SQL Databases Procedural Basic knowledge in unit testing Basic knowledge in Agile Software Practices Security clearance of Top Secret (TS/SCI) - Active U.S. citizenship required English: Basic knowledge Preferred Bachelor's Degree At least 2 years experience in HBase and HBase Code development At least 5 years experience in developing code in Java and scripting languages At least 5 years experience in No-SQL Databases Procedural At least 5 years experience in unit testing At least 1 year experience in IBM BigMatch/Initiate At least 1 year experience in Pentaho English : Intermediate ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
