{
    "id": "GBS-0726787",
    "label": "Oracle Business Solution Professional - Texas, Oklahoma, Louisiana (TOLA) Region",
    "parts": [
        {
            "data": "A few years ago IBM celebrated its Centennial, proudly looking back at a history of achievement, leadership, and commitment to innovation and progress. Looking forward, we see a century full of opportunities as we maintain our focus to help make the world work smarter, by using technology to deliver the things people care about most – from energy production to climate change, traffic congestion to health care, streamlined government processes to citizen collaboration and everything in between. We are the world's largest IT and consulting company with unmatched opportunities. But we’re much more than that. We also have unmatched capabilities – an unparalleled ability to bring together business insight, advanced research, analytics, and technology, combined with proven roadmaps and frameworks developed across 17 industries and a unique blend of skills and experiences of our teams in over 170 countries. Our thriving Oracle practice is consistently recognized in the global marketplace as a leader. Working alongside our talented experienced consultants, you’ll have the opportunity to determine innovative solutions which overcome complex business challenges. Build your portfolio at IBM while delivering solutions that tackle society's biggest issues. Join IBM Global Business Services (GBS). Oracle Business Solution Professional (BSP) will be assigned to the Texas, Oklahoma, Louisiana (TOLA) area and will be selling consulting services for all Oracle applications such as Customer Relationship management and Business Intelligence. The candidate will drive pipeline and value proposition, so they must have experience selling services for Oracle application and have relationships with the Oracle sales organization. Responsibilities include working with the Oracle applications sales organization to identify opportunities, working with the IBM sales organization to position Oracle based solutions and identify opportunities, qualifying GBS opportunities, developing a sales strategy, working on proposals and client presentations. This role will engage the appropriate IBM resources and subject matter experts and work to differentiate IBM in the sales process. The BSP will work collaboratively with GBS partners and other brands/organizations within IBM. In summary, the BSPs focus is on finding leads, qualifying the leads, establishing win themes/differentiation for IBM, and establishing/improving client relationships. Position requires 50% travel For more information on our world-class Oracle solutions and services, please visit: http://www.ibm.com/solutions/oracle/us/en/4687 (GTMP) Required Bachelor's Degree At least 3 years experience in Identifying and selling services for Oracle application At least 3 years experience in Experience in strategic selling, which includes crafting and presenting a value proposition, including a client-specific solution (solution elements include benefits, roadmap, approach, timelines, etc Readiness to travel Up to 3 days a week (home on weekends-based on project requirements) English: Fluent Preferred Master's Degree At least 5 years experience in Identifying and selling services for Oracle application At least 5 years experience in Experience in strategic selling, which includes crafting and presenting a value proposition, including a client-specific solution (solution elements include benefits, roadmap, approach, timelines, etc ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
