{
    "id": "GBS-0711504",
    "label": "Oracle Technical Developer",
    "lastbuild": "2015-03-10T11:22:40.913Z",
    "parts": [
        {
            "data": "Job description The Oracle Developer will provide ongoing maintenance and support capability for a shared services implementation of Oracle Federal Financials. The developer will perform Oracle R12 technical development services and will work with an existing multi-vendor team. Project scope includes functional support for Procure to Pay (P2P), Order to Cash (O2C), and Budget to Report (B2R) workstreams. The initial work assignment will on the R12 upgrade team, supporting an upgrade from R11i to R12 scheduled to be completed in early 2015. Ongoing responsibilities will evolve to include rollout to Government agencies and continued development and support in the R12 environment. Ability to work in a team and demonstrated communication skills are preferred.Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities.IBM Global Business Services: Join a Leader. Consult with us.Required High School Diploma/GED At least 3 years experience in Oracle Technical Developer At least 1 year experience in  Oracle Federal Financials R12 At least 1 year experience in implementing Oracle Financials solutions in a Public Sector environment Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) U.S. citizenship required English: Basic knowledge Preferred Bachelor's Degree At least 5 years experience in Oracle Technical Developer At least 2 years experience in  Oracle Federal Financials R12 At least 2 years experience in implementing Oracle Financials solutions in a Public Sector environment At least 5 years experience in demonstrated oral and written communication skills At least 5 years experience in Customer focused At least 5 years experience in Ability to multi-task and achieve results while working under pressure in a driven environment At least 1 year experience in Prior experience working with DoD agencies, including DAI At least 1 year experience in Prior experience with IT Service Management (Help Desk) tools, e.g., Remedy At least 1 year experience in Knowledge of and experience applying a Software Development Life Cycle (SDLC) framework, e.g., Oracle Unified Method Security clearance of Secret - Active English : Intermediate",
            "name": "Job description",
            "type": "text"
        }
    ]
}


