{
    "id": "GBS-0731786",
    "label": "Market Dynamics Analyst ",
    "parts": [
        {
            "data": "This project will consolidate the procurement and assistance components of the current Deliver and Supply Chain Management System (SCMS), also known as President's Emergency Plan for Aids Relief (PEPFAR), programs and will be the primary vehicle through which the government will procure and provide health commodities to partner countries and provide assistance to improve countries’ management of the supply chains for such commodities. To support global health initiatives in HIV/AIDS, malaria, maternal and child health, and reproductive health, the project has three primary objectives: global commodity procurement and logistics, systems strengthening to support in-country supply chain management, and collaboration via strategic engagement to improve long-term global supply of health commodities. The Market Dynamics Analyst will be responsible for conducting demand, spend and market analyses for global health care commodity groups to ensure least cost procurements at the lowest risk possible, capturing and analyzing market intelligence to identify trending or past changes that may affect the global health care commodities market. The Market Dynamics Analyst will work under guidance from the Market Dynamics Manager. This role will also work closely with the Knowledge Management and Communications Teams. The Market Dynamics Analyst will be responsible for · Researching and analyzing market intelligence on the global pharmaceutical market · Building knowledge of the pharmaceutical markets into scenarios and forecasts used to support the supply chain planning and supplier relationship management teams · Supporting the development of Market Dynamics reports and presentations for delivery to the teams Executive Board and advisory groups · Running statistical models to analyze the market intelligence gathered and determining the potential impact on the Supply Chain · Conducting market research and analyzing market dynamics, assessing risk, analyzing and revalidating total cost value chain analysis and identifying commodity optimization opportunities in the market. · Drafting reports, briefs, talking points, peer-reviewed publications, and oral presentations to a diverse, external audience, including: policy makers, academics, and other government organizations In addition, the Market Dynamics Analyst will be responsible for · Building knowledge of select markets in the medium to long term to estimate global health demands relative to the program · Conducting research on current and future suppliers product development and investment plans and translating this information for input to the Demand and Supply Planning teams · Conducting market dynamic analysis for globally sourced healthcare commodities supporting Africa Asia and Latin America · Identifying and modeling the impact of potential activity in the pharmaceutical market related to this program, and identifying the likely impact of deals including mergers and acquisitions on supply side modeling and management · Other activities as necessary in support of market shaping and program communications relative to the market Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities. IBM Global Business Services: Join a Leader. Consult with us. (2252) Required Bachelor's Degree Basic knowledge in supply forecasting and market research Basic knowledge in key organizations working in the area of Global Health Basic knowledge in SPSS or SAS At least 4 years experience in analytical, problem solving, and quantitative modeling skills, plus affinity for analytics and information management Basic knowledge in collection, analysis and use of market information to anticipate trends in global health care, or a related industry Basic knowledge in developing and communicating results in a clear and concise manner to a diverse audience Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Basic knowledge Preferred Master's Degree At least 6 years experience in analytical, problem solving, and quantitative modeling skills, plus affinity for analytics and information management Basic knowledge in conducting demand spend and market analyses for global health care commodity groups Basic knowledge in working with key organizations in the area of HIV/AIDS, tuberculosis and malaria with a focus on prevention, diagnosis and treatment Basic knowledge in collection, analysis and use of market information on pharmaceutical supply chains and/or program management for global public health programs Basic knowledge in mathematical optimization or predictive analytics English : Intermediate ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
