{
    "id": "GBS-0731914",
    "label": "Senior Extract, Transform Load (ETL) Datastage Specialist",
    "parts": [
        {
            "data": "The Senior DataStage Specialist is responsible for successful development of Extract, Transform Load (ETL) solutions. The Senior DataStage Specialist conducts data mapping, designs, develops and implements extract/transform/load processes/solutions. The Specialist will support software upgrades, software documentation, research of new software versions, backup / recovery, ETL Repository administration including promotion of software packages to the proper environment, troubleshooting, and technical support. In addition, this role will design logical/physical models, develop and test DataStage jobs, and build an analytics layer within the existing architecture for analytics. Consultants will be located in an IBM office in the metropolitan area or at an IBM client site. Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel. Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities. IBM Global Business Services: Join a Leader. Consult with us. (2252) DCHJ Required High School Diploma/GED At least 5 years experience in ETL data design, database architecture, metadata and repository creation At least 2 years experience in InfoSphere Information Server At least 3 years experience in providing technical consulting in the design, creation of a database environment At least 3 years experience in coordinating data administration technical function for data warehouse, data mart, and business intelligence development and maintenance At least 3 years experience in Database design and structure At least 3 years experience in coding and documenting scripts and stored procedures At least 3 years experience in working closely with other Technical/Development teams Security clearance of Ability to obtain and maintain a Public Trust (MBI) clearance Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Basic knowledge Preferred Bachelor's Degree At least 8 years experience in ETL data design, database architecture, metadata and repository creation At least 5 years experience in providing technical consulting in the design, creation of a database environment At least 5 years experience in coordinating data administration technical function for data warehouse, data mart, and business intelligence development and maintenance At least 5 years experience in Database design and structure At least 5 years experience in coding and documenting scripts and stored procedures At least 5 years experience in working closely with other Technical/Development teams English : Intermediate ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
