{
    "id": "GBS-0722168",
    "label": "SAP Financial Supply Chain Management (FSCM) Dispute Management/Credit Management/Collection, Finance (FI) - Accounts Receivable (AR)",
    "parts": [
        {
            "data": "SAP Financial Supply Chain Management (FSCM) Dispute Management/Credit Management/Collection, Finance (FI)-Accounts Receivable (AR) will serve as a SAP Application Functional Specialist, providing application functional support and implementation in SAP Applications R/3, in the module areas of FI. The SAP Application Functional Specialist will be very knowledgeable with required SAP product module/suite business processes, navigation mechanics, and configuration requirements and integration with other modules and SAP's Business Warehouse. This individual will develop and maintain the configuration and functional design documents and support role based profile changes. The individual is expected to perform all tasks in the development cycle, starting from business process definition, to configuration and unit testing, assistance and follow-up with user testing, to co-ordination of transports to Production, to training and post-live support and fixes, etc. Be a Package Solution Consultant at IBM. You won't just be solving IT problems, you'll be working with our top-tier clients to help them meet their business needs through innovative solutions. You'll be a trusted advisor, helping our clients make better, informed decisions. How? Using in-depth consulting skills, business knowledge, and packaged solution expertise, you'll work directly with clients to select, implement, support and effectively integrate IBM's world-class packaged technology solutions into their diverse business environments. At IBM, you'll get experience with projects that span the globe, and work with the world's largest experienced services skill pool, in more than 170 countries worldwide. Join us. Required Bachelor's Degree  At least 2 years experience in FSCM components like Dispute Management, Credit management, Deductions Management or Collections Management At least 2 years experience in SAP FSCM and SAP AR integration At least 2 years experience in Setting up functionality prototype, system configuration support testing and deployment activities. As well as independently conducing requirements gathering workshops. Basic knowledge in FI-AR: Lockbox processing, statements, aging reports, reason codes, bad debt, cash application At least 3 years experience in Hands-on SAP Finance / Controlling configuration At least 3 years experience in 3 full project lifecycle implementations with the SAP Finance module Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Basic knowledge Preferred  At least 3 years experience in FSCM components like Dispute Management, Credit management, Deductions Management or Collections Management At least 4 years experience in SAP FSCM and SAP AR integration At least 4 years experience in Setting up functionality prototype, system configuration support testing and deployment activities. As well as independently conducing requirements gathering workshops. At least 1 year experience in FI-AR: Lockbox processing, statements, aging reports, reason codes, bad debt, cash application At least 6 years experience in Hands-on SAP Finance / Controlling configuration At least 6 years experience in 3 full project lifecycle implementations with the SAP Finance module English : Intermediate",
            "name": "Job description",
            "type": "text"
        }
    ]
}