{
    "id": "GBS-0727288",
    "label": "Client Solution Executive",
    "parts": [
        {
            "data": "Application Development & Innovation Services (AD&I) is part of the worldwide Global Business Services (GBS) Application Services (AS) organization and is responsible for selling and delivering application development, integration and management services to their clients. The AD&I Client Solution Executive acts as the primary solution executive responsible for driving client solutions, deal strategy, leading the bid process and proposal development, and closing an AD&I deal, while working closely with the Account Partner. Job Responsibilities: Targets key clients within their assigned industry or industries and develops relationships with key executives to help position AD&I solutions and services. Analyzes client’s business, goals, strategies, industry trends and directions to develop compelling value propositions for the client that exceed their expectations. Formally engages and leads large multi-disciplinary teams in developing complex solutions for specific client opportunities and in developing client deliverables such as a Requests For Information (RFI), Requests For Proposal (RFPs), and Statements Of Work (SOWs) or presentations. Develops the financial solution for a deal based on client requirements and the competitive marketplace while ensuring IBM Global Services meets its profit goals and objectives over the life of the contract; Makes decisions on the components that drive the deal strategy, managing possible tradeoffs to win the contract, with overall marketing responsibility for the final winning proposal to the client. Leads client negotiations to market proposed solutions to senior client executives, including CEO, CFO, CIO, Boards of Directors, and Evaluation Committees; conducts customer negotiations and resolves complex issues at the senior executive level. Acts as the single point of client contact for all AD&I activities at their assigned accounts May manage multiple opportunities concurrently Key Qualifications: Background in application development/management and IT strategy/planning Positive sales record for large scale deals Readiness to travel up to 75%, traveling 5 days a week, home on weekends Required Bachelor's Degree At least 5 years experience in selling and delivering Application Development, Integration and Management Services At least 5 years experience in managing multi-Line Of Business (LOB), multi-geo, and multi-discipline pursuits At least 5 years experience in negotiation skills on large deals At least 5 years experience in consultative selling At least 5 years experience in using written and oral communication skills, including proposal writing and presentation material development and delivery At least 5 years experience in Public Sector - state, local government and higher education - Industry Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Basic knowledge Preferred Master's Degree At least 10 years experience in selling and delivering Application Development, Integration and Management Services At least 10 years experience in managing multi-Line Of Business (LOB), multi-geo, and multi-discipline pursuits At least 10 years experience in negotiation skills on large deals At least 10 years experience in consultative selling At least 10 years experience in using written and oral communication skills, including proposal writing and presentation material development and delivery At least 10 years experience in Public Sector - state, local government and higher education",
            "name": "Job description",
            "type": "text"
        }
    ]
}