{
    "id": "GBS-0731796",
    "label": "Software Tester",
    "parts": [
        {
            "data": "IBM Global Business Services (GBS) is looking for a Software Test Engineer to provide software test support for client. Clients application consists of three major workflows and a variety of other tools, links, and applications. The tester needs to become familiar with application features, as necessary to: • Review new requirements, use cases, and other artifacts for the application • Develop and execute test cases based on use cases and other design artifacts • Apply expertise on multiple complex work assignments that are broad in nature, requiring originality and innovation in determining how to accomplish tasks. • Apply a comprehensive knowledge across key tasks and high-impact assignments. • Function as a technical subject matter expert across multiple project assignments Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities. IBM Global Business Services: Join a Leader. Consult with us. (2252) PSHJ DCHJ Required High School Diploma/GED At least 4 years experience in most standard Software Development Lifecycles (Waterfall, RUP/Iterative, etc.) At least 4 years experience in software application System Integration Testing (SIT) and other structured testing concepts At least 4 years experience in test planning and test case development At least 4 years experience in testing of multi-tiered applications At least 4 years experience in using case-based requirements At least 4 years experience in Windows XP/200x/7.0 Internet Explorer 8 to current. Mozilla Firefox, AIX, DB2, Oracleit sure Security clearance of ability to obtain DHS Public Trust/Moderate Risk Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) U.S. citizenship required English: Basic knowledge Preferred Bachelor's Degree At least 2 years experience in Rational Team Concert (RTC) At least 2 years experience in Rational Quality Manager (RQM) At least 2 years experience in software structured testing processes Security clearance of DHS Public Trust/Moderate Risk English : Intermediate ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
