{
    "id": "GBS-0630235",
    "label": "Senior .NET Developer",
    "lastbuild": "2015-03-10T13:39:40.913Z",
    "parts": [
        {
            "data": "Job description Want your skills to make a difference in how the world works - for the better? IBM is seeking keen-minded Application Developers interested in working next to some of the best IT Specialists in the industry.The Senior Application Developer will apply technical expertise / capabilities to develop efficient software solutions for customer applications, based upon business requirements; Analyze customer requirements; Perform all programming functions to accomplish specific software solution requirements; Design (or modify) systems to accomplish functions in compliance with the Software Development Life Cycle framework; Verify the accuracy and validity of all software developed, including preparations of sample test data and the execution of program, job stream, and system testing; Prepare all required documentation indicating system functionality.Review and update the Deployment Document, Change Request document and design document. Justify the root cause of application issue, :system down or database failure and make accurate decision to fix or repair the issues.Most important certifications are as follows (in order of preference) 1. 70-515 Web Applications 2. 70-516 Data Access (Entity Framework) 3. 70-480 Programming in HTML with JavaScript and CSS3 4. 70-461 Querying Microsoft SQL Server 2012 5. 70-432 Implementation and maintenance SQL Server 2008 6. 70-448 Business intelligence Development and Maintenance SQL Server 2008.Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Candidate must have the ability to work in the United States without a current or future need for visa sponsorship.Required High School Diploma/GED At least 5 years experience in performing complex analysis, design, development, testing, and implementation At least 5 years experience in demonstrated .NET development / architecture experience At least 5 years experience in performing as a technical resource or developer for a large team At least 4 years experience in development systems utilizing products / languages C#, SQL At least 2 years experience in managing and/or performing complex analysis, design, development, testing and implementation of web-based and legacy systems on a variety of technical platforms Readiness to travel Up to 1 day a week English: Intermediate Preferred Bachelor's Degree Basic knowledge in Microsoft Certified",
            "name": "Job description",
            "type": "text"
        }
    ]
}


