{
    "id": "GBS-0696779",
    "label": "J2EE Applications Developer",
    "lastbuild": "2015-03-10T11:48:40.913Z",
    "parts": [
        {
            "data": "Job description IBM is currently seeking a J2EE Developer. Highly skilled senior developer to serve as technical lead of implementation, maintenance, enhancement, and support of software solutions. Responsible for design, development, enhancement, troubleshooting, and debugging of J2EE web applications, including portal and BPM solutions. Develop impact assessments, including level of effort, for implementation of new requirements and defect fixes. Addresses issues associated with systems integration, compatibility, and multiple platforms. Consults with project teams and end users to identify and clarify application requirements. Assists in performing feasibility analysis on potential future projects.  Assists in the evaluation and recommendation of application software packages, application integration, and development/testing tools. Participates in development of software user manuals, training materials, and technical reports. Provide technical direction and coaching for members of the development team.Work is located in Fairfax VA.Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities.IBM Global Business Services: Join a Leader. Consult with us.Required High School Diploma/GED At least 5 years experience in  web design and development experience maintaining and enhancing applications developed using J2EE, Java, Html, SQL, Java, Unix, Rapid Prototyping At least 3 years experience in  WebSphere Portal Development Environment (Struts Portlets) At least 5 years experience in  development experience using Rational Application Developer (RAD) Security clearance of Ability to obtain and maintain DHS Public Trust/Moderate Risk Readiness to travel Up to 1 day a week U.S. citizenship required English: Intermediate Preferred Bachelor's Degree",
            "name": "Job description",
            "type": "text"
        }
    ]
}


