{
    "id": "GBS-0731274",
    "label": "Business Analytics/Business Intelligence Project Manager - Business Analytics & Strategy",
    "parts": [
        {
            "data": "IBM's Business Analytics & Strategy (BA&S) service line is looking for a Business Analytics/Business Intelligence Project Manager who will be directly accountable/responsible for successful project delivery of business analytics solutions, using formal project management methodology, providing hands-on leadership and direction to the team, as well as managing client relationships. This is a hands-on consulting delivery role in a complex and integrated environment. Candidates for this role are expected to develop/maintain senior client relationships, and to participate in business development activities. Skills for this position require applicants who are equally adept at people, and business management. Besides the knowledge of methods to initialize, plan, execute, control and monitor a project, IBM Project Managers (PMs) use skills and leadership competencies for team building, client relations, negotiation, decision making, problem solving and conflict management. Ensuring scope, cost, schedule and contractual deliverables, they apply techniques for planning, tracking, change control and risk management. Your future, made with IBM We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming industries, society and even the workplace—by creating professions that didn’t exist before the emergence of data, cloud, social and mobile. IBM Global Business Services is a leader in this worldwide transformation and just the place to define and develop your consulting career. Whether it’s business consulting, sales, project management or a technical path, you’ll have the opportunity to make an impact on the world by working to solve some of society’s most complex problems with your original thinking and ideas. As an IBMer, you’ll innovate in pursuit of higher value in everything you do, all while being guided by IBM’s purpose—to be essential. Essential in your leadership and dedication to building valuable client relationships with groundbreaking work. Essential in uncovering what’s possible and helping global clients succeed. Join us as we make the most of these exciting times and discover what you can make of this moment. What will you make with IBM? ibm.com/jobs Required Bachelor's Degree At least 3 years experience in managing and delivering all phases of a business analytics and/or Business Intelligence (BI) solution project At least 3 years experience in leading a consulting team through implementation and deployment At least 3 years experience in formal project management methodology At least 3 years experience in project management processes and best practices Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Fluent Preferred Master's Degree At least 5 years experience in managing and delivering all phases of a business analytics and/or Business Intelligence (BI) solution project At least 5 years experience in leading a consulting team through implementation and deployment At least 5 years experience in formal project management methodology At least 5 years experience in project management processes and best practices Certified in Project Management (PMI, etc.)",
            "name": "Job description",
            "type": "text"
        }
    ]
}