{
    "id": "GBS-0714768",
    "label": "Big Data Developer & Designer - Business Analytics & Strategy (BA&S)",
    "lastbuild": "2015-03-10T12:03:40.913Z",
    "parts": [
        {
            "data": "Job description IBM's Business Analytics & Strategy (BA&S) service line is looking for Big Data Developer & Designer with deep technical experience and a strong understanding of the non-relational data space. This person has a complete architectural understanding of Hadoop, HBase, Hive, Pig, Jaql, Lucene, Avro, Zookeeper, R, UIMA technologies and keeps abreast of the evolving technology. This role is a technology expert with experience providing technology leadership to large delivery teams and clients through subject matter expertise and communication.Big Data Developer & Designer has experience in areas of optimizing management of and deriving insights from non-structured non-relational data, and providing business value from content through improved information management, Business Process Optimization (BPO) and advanced analytics. Candidates for this role will apply semantic correlation, ontology and text analytics techniques and systems to analyze non-structured data and identify critical insights for overall business analytics across various domains. Big Data Developer & Designer needs to have experience in analyzing text, streams, documents, social media, big data, speech and video with emerging Hadoop-based big data, NoSQL, Natural Language Processing, Search and Text analytics technologies and techniques. They will need to apply Big Data technologies, such as Hadoop or Cassandra, with NoSQL data management and related programming languages, such as Jaql, HBase, Pig, or Hive, for analytics and experimentation with large, multi-structured data sets. Candidates for this role will participate in all aspects of software life cycle, including analysis, design, development, unit testing, production deployment and support, including creating formal written deliverables and other documentation. They will formulate approaches and gather data to solve business problems, develop/analyze/draw conclusions and present solutions.It is also expected that newly hired resources into the Global Business Services U.S. practice live within a reasonable commuting distance (generally 50 miles) of the following cities: Atlanta, GA; Boston, MA; Charlotte, NC; Chicago, IL; Cincinnati, OH; Columbus, OH; Cleveland, OH; Dallas, TX; Denver, CO; Detroit, MI; Hartford, CT; Houston, TX; Kansas City, MO; Los Angeles, CA; Miami, FL; New York City, NY and surrounding area; Philadelphia, PA; San Francisco, CA; and Washington, DC.Your future, made with IBM We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming industries, society and even the workplace—by creating professions that didn’t exist before the emergence of data, cloud, social and mobile. IBM Global Business Services is a leader in this worldwide transformation and just the place to define and develop your consulting career. Whether it’s business consulting, sales, project management or a technical path, you’ll have the opportunity to make an impact on the world by working to solve some of society’s most complex problems with your original thinking and ideas. As an IBMer, you’ll innovate in pursuit of higher value in everything you do, all while being guided by IBM’s purpose—to be essential. Essential in your leadership and dedication to building valuable client relationships with groundbreaking work. Essential in uncovering what’s possible and helping global clients succeed. Join us as we make the most of these exciting times and discover what you can make of this moment.Required Bachelor's Degree At least 3 years experience in distributed systems design and development using Java/C++/Python/Perl/Unix Scripting At least 3 years experience in Business Intelligence (BI) full lifecycle engagements At least 3 years experience in data modeling in non-relational databases, such as Cassandra, HBase, MongoDb, etc. At least 2 years experience in technical consulting At least 1 year experience in Streams and Big Data architectural concepts At least 1 year experience in one or more of the following technologies: Hadoop, BigInsights, Streams, Unica, Aginity, etc. At least 1 year experience in demonstrating excellent written and oral communication skills Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Intermediate Preferred Master's Degree At least 5 years experience in distributed systems design and development using Java/C++/Python/Perl/Unix Scripting At least 5 years experience in Business Intelligence (BI) full lifecycle engagements At least 4 years experience in data modeling in non-relational databases, such as Cassandra, HBase, MongoDb, etc. At least 3 years experience in technical consulting At least 3 years experience in Streams and Big Data architectural concepts At least 3 years experience in one or more of the following technologies: Hadoop, BigInsights, Streams, Unica, Aginity, etc. At least 3 years experience in demonstrating excellent written and oral communication skills At least 1 year experience in UIMA (Text Analytics) English : Fluent",
            "name": "Job description",
            "type": "text"
        }
    ]
}


