{
    "id": "GBS-0732349",
    "label": "Test Lead",
    "parts": [
        {
            "data": "IBM is looking for a Test Lead with experience developing test and evaluation master plans to lead the testing of complex Master Data Management (MDM) solutions. Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities. IBM Global Business Services: Join a Leader. Consult with us. (2252) PSHJ DCHJ Required High School Diploma/GED At least 5 years experience in leading the testing of complex Master Data Management Solutions At least 5 years experience in developing Test and Evaluation Master Plans (TEMPs) At least 5 years experience in full test lifecycle from unit testing through user acceptance testing At least 5 years experience in coordinating test resources (people and technology) to accomplish program testing objectives At least 5 years experience in full Software Development Lifecycle At least 5 years experience in coordinating the release of software following the successful executing of program test events Security clearance of Clearable to Secret Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) U.S. citizenship required English: Basic knowledge Preferred Bachelor's Degree At least 6 years experience in leading the testing of complex Master Data Management Solutions At least 6 years experience in developing Test and Evaluation Master Plans (TEMPs) At least 6 years experience in full test lifecycle from unit testing through user acceptance testing At least 6 years experience in coordinating test resources (people and technology) to accomplish program testing objectives At least 6 years experience in full Software Development Lifecycle At least 6 years experience in coordinating the release of software following the successful executing of program test events Security clearance of Secret - Active English : Intermediate ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
