{
    "id": "GBS-0731887",
    "label": "SAS Modeler",
    "parts": [
        {
            "data": "The SAS Modeler will be responsible for enabling Data Analytics, creating a logical file structure of unstructured data files to facilitate retrieval via appropriate SAS software for exploitation using SAS Text Miner and eventual integration with structured data. This role is responsible for assisting the client in developing program code which enables faceted navigation and analysis of unstructured text through appropriate normalizing and indexing of consistent syntax and semantics to create a single audit ontology with effective linguistic rules. They will assist the client in developing program code for effective SAS projects which draw from data, structured and unstructured, to produce reports which can be printed and exported as .pdf or .xlsx files, and geographically mapping audit data and overlaying with spending data, enabling visual analysis with drill-down capability using Online Analytical Processing (OLAP) capability of SAS. Consultants will be located in an IBM office in the metropolitan area or at an IBM client site. Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities. IBM Global Business Services: Join a Leader. Consult with us. (2252) DCHJ Required High School Diploma/GED At least 2 years experience in SAS At least 2 years experience in programming, with the ability to develop sophisticated statistical analytical queries and reports and ability to change canned reports using SAS At least 2 years experience in working with large relational databases including linking large databases (Oracle, MS access, SQL, and other similar software) At least 2 years experience in programming queries and analytic reports to support analyses At least 2 years experience in analyzing and articulating results so others can understand the results Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) U.S. citizenship required English: Basic knowledge Preferred Bachelor's Degree At least 3 years experience in SAS At least 3 years experience in programming, with the ability to develop sophisticated statistical analytical queries and reports and ability to change canned reports using SAS At least 3 years experience in working with large relational databases including linking large databases (Oracle, MS access, SQL, and other similar software) At least 3 years experience in programming queries and analytic reports to support analyses At least 3 years experience in analyzing and articulating results so others can understand the results English : Intermediate ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
