{
    "id": "GBS-0719817",
    "label": "Senior Mobile iOS Developer",
    "lastbuild": "2015-03-10T13:29:40.913Z",
    "parts": [
        {
            "data": "Job description IBM Interactive is a team of mobile subject matter experts that are regarded as thought leaders and innovators with proven track records of success. IBM Interactive is continuing to expand to meet client demand. As a result a number of exciting opportunities have arisen for skilled mobility professionals to become part of the Global Practice team. As a member of the world's leading and largest consulting organization, you'll tap into resources that only a global leader like IBM can provide: access to a vast and diverse network of talented professionals; enjoy unparalleled career opportunities; be provided with ongoing training and education that you'll need to succeed; and work on some of the most interesting projects on the planet, helping everyone from organizations to local governments, work smarter.Objective C/Swift iOS developer to participate in the design and development of highly interactive iPhone and iPad projects for high profile projects. This position requires well-rounded development skills with front end development experience including HTML and Apple's iOS Software Development Kit (SDK). The ideal candidate will have iOS development experience in high profile interactive projects. As a Senior Developer, you will also be required to assist in mentoring junior iOS Developers and growing them into world class senior developers, ensuring the quality of the code on projects and demonstrating iOS Developer eminence at conferences or by publishing white papers.We expect a understanding of iOS design patterns/coding conventions, Apple’s Human Interface Guidelines, and App Store Review Guidelines as well as: An understanding of client-server development in a mobile environment Proven architecture skills Experience with task planning and estimating effort Experience leading projects and overseeing development teams When working with other key stakeholders the candidate should be able to articulate deeply technical concepts in a customer friendly and understandable way. This would involve being able to assist with project managers, designers and information architects in scoping and pricing front end applications as well as working with a team of developers during the build, test and deployment phases. We're looking for engineers who care about the quality of their code. Engineers who are passionate about providing the best solution to meet the client's needs and anticipate their future needs based on an understanding of the market. We seek developers with object-oriented design skills and a track record of delivering designs to market, a solid understanding of the Software Development Life Cycle (SDLC), and a fundamental love of Application Programming Interface (API), with expertise in rapid prototyping, with the ability to quickly go from mock-ups to implementation.Preferred skills include adaptive design, a sense of UX, mobile design patterns, and visual design with an eye for simple-to-use interfaces, as well as a working knowledge of testing from unit to functional in a mobile context, and Agile development processes including Scrum.It is also expected that new hires live within a reasonable commuting distance (generally 50 mi or less) of Chicago, IL.As a member of the world's leading and largest consulting organization, you'll tap into resources that only a global leader like IBM can provide: access to a vast and diverse network of talented professionals; enjoy unparalleled career opportunities; be provided with ongoing training and education that you'll need to succeed; and work on some of the most interesting projects on the planet, helping everyone from organizations to local governments, work smarter.Required High School Diploma/GED At least 2 years experience in developing iOS applications At least 2 years experience in aspects of the mobile lifecycle. Examples include: application development (application structure, device and operating system API’s, debugging, performance, security) and deployment. At least 2 years experience in one of more of the following: Ajax, REST, JSON At least 2 years experience in using version control systems such as GIT At least 2 years experience in leading development teams At least 2 years experience in estimating development effort Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Fluent Preferred At least 4 years experience in developing iOS applications At least 3 years experience in aspects of the mobile lifecycle. Examples include: application development (application structure, device and operating system API’s, debugging, performance, security) and deployment. At least 3 years experience in one of more of the following: Ajax, REST, JSON At least 3 years experience in using version control systems such as GIT At least 4 years experience in leading development teams At least 4 years experience in estimating development effort",
            "name": "Job description",
            "type": "text"
        }
    ]
}


