{
    "id": "GBS-0706004",
    "label": "PeopleSoft Application Developer",
    "lastbuild": "2015-03-10T11:55:40.913Z",
    "parts": [
        {
            "data": "Job description The PeopleSoft Application Developer will develop and test Reports, Interfaces, Conversions, Extensions, and Workflow (RICEW) based on Functional Specifications provided by the Blueprinting team. Ability to work in a team with demonstrated communication skills are essential.Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities.IBM Global Business Services: Join a Leader. Consult with us.Required Bachelor's Degree Basic knowledge in Interest in becoming a PeopleSoft technical developer Basic knowledge in Completion of PeopleTools development training At least 1 year experience in Strong collaboration and interpersonal skills At least 1 year experience in Excellent oral and written communication skills At least 1 year experience in Ability to multi-task and achieve results while working under pressure in a driven environment Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) U.S. citizenship required English: Basic knowledge Preferred At least 1 year experience in Interest in becoming a PeopleSoft technical developer At least 1 year experience in Completion of PeopleTools development training At least 3 years experience in Strong collaboration and interpersonal skills At least 3 years experience in Excellent oral and written communication skills At least 1 year experience in Experience with SQR or PeopleCode At least 3 years experience in Ability to multi-task and achieve results while working under pressure in a driven environment At least 1 year experience in Prior experience in PeopleSoft system implementation or development At least 1 year experience in Prior experience working with PeopleTools 8.51 or higher At least 1 year experience in Prior experience working in a Public Sector environment (Federal Civilian, Federal Department of Defense (DoD), State and Local Government) At least 1 year experience in • Prior experience with PeopleSoft (HCM)/Payroll 9.1 or 9.2 • Prior experience with PeopleSoft (RICEW) development • Prior experience with software development team collaboration tools Certified in PeopleSoft Certification English : Intermediate",
            "name": "Job description",
            "type": "text"
        }
    ]
}


