{
    "id": "GBS-0628028",
    "label": "IBM BPM Developer",
    "lastbuild": "2015-03-10T11:00:40.913Z",
    "parts": [
        {
            "data": "Job description IBM Global Business Services (GBS) Application Innovation Services (AIS) has established a team of Business Process Management thought leaders and experts. The focus of this team is developing solutions and delivering Business Process Management and Business Rules Management programs for our clients.The IBM Business Process Manager (BPM) Developer will collaborate with BPM Analysts and BPM Consultants to create BPM solutions using IBM Business Process Manager (Advanced), IBM BlueWorks Live, IBM Business Monitor and other integration tools (i.e., WebSphere Process Server, WebSphere Integration Designer / Developer, WebSphere Enterprise Service Bus, etc.). The IBM BPM Developer will also deliver on client non-functional requirements for the solutions such as scale, performance, reliability, reuse, physical and logical architecture. Key responsibilities include: Collaborate with BPM Analysts, Technical Architects and Project Managers to build solutions that solve customer problems and deliver business value. Directly contribute to solution development in the areas of process flow, business logic and user interface. Lead solution playbacks to iterate requirements and implementation directly with business users. Apply business modeling frameworks such as Business Process Modeling Notation (BPMN) to solutions. Apply business concepts such as key process indicators, service level agreements, metrics and reporting to solutions. Control the flow of process execution, decision making and exception management across multiple organizational roles and systems/applications. Tailor user screens for each process activity to enable end-users to interact with multiple internal/external systems through a single interface. Build an executable process model that communicates enough implementation detail for direct execution while retaining clarity required for maintainability and business stakeholder communication. Proactively monitor BPM process execution and perform performance tuning using IBM Business Monitor and other options provided in the software for ensuring optimal configuration and performance. Develop integration to other vendor products like ERP, CRM etc. using IBM WebSphere Integration Designer or other integration technologies/techniques. Install, configure and manage an IBM BPM (advanced) environment using core product skills and best practice methods.IBM Global Business Services - Help Make the World Work Smarter.The world is getting smarter, triggering unprecedented change. IBM's unparalleled ability to bring together deep business insight, advanced research, analytics, and technology enables IBM Global Business Services to help position its clients for the future. We leverage the proven roadmaps and frameworks that have been developed across 17 industries and the unique combination of skills and experiences of our teams in over 170 countries - unmatched capabilities. When you join IBM, you'll partner with our clients, and leverage these capabilities to deliver real business value.As a member of the world's leading and largest consulting organization, you'll tap into resources that only a global leader like IBM can provide: access to a vast and diverse network of talented professionals; enjoy unparalleled career opportunities; be provided with ongoing training and education that you'll need to succeed; and work on some of the most interesting projects on the planet, helping everyone from organizations to local governments, work smarter.Required Bachelor's Degree At least 1 year experience in demonstrating ability to understand business problems and articulate a corresponding solution Basic knowledge in describing solutions and generating the (BPM) architecture artifacts At least 1 year experience in developing business process applications using IBM Business Process Manager (BPM), IBM BlueWorks Live and/or IBM Websphere Integration Designer / Developer At least 1 year experience in integrating an application with other applications using SOA/web services At least 1 year experience in application development with Java, JavaScript, Visual Basic or PHP At least 1 year experience in databases (DB2, SQL Server, Oracle etc) Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) English: Intermediate Preferred At least 3 years experience in demonstrating ability to understand business problems and articulate a corresponding solution  At least 3 years experience in describing solutions and generating the (BPM) architecture artifacts  At least 3 years experience in developing business process applications using IBM Business Process Manager (BPM), IBM BlueWorks Live and/or IBM Websphere Integration Designer / Developer  At least 3 years experience in integrating an application with other applications using SOA/web services  At least 3 years experience in application development with Java, JavaScript, Visual Basic or PHP At least 3 years experience in databases (DB2, SQL Server, Oracle etc)",
            "name": "Job description",
            "type": "text"
        }
    ]
}


