{
    "id": "GBS-0618580",
    "label": "Mobile Application Developer",
    "lastbuild": "2015-03-10T10:57:40.913Z",
    "parts": [
        {
            "data": "Job description Want your skills to make a difference in how the world works - for the better? IBM is seeking keen-minded Application Developers interested in working next to some of the best IT Specialists in the industry.The mobile developer will be required to design, develop, test, document, deploy, support and sustain the mobile apps--iPhone, iPad, Android, Windows Mobile-- interface and libraries. The mobile developer is expected to be able to design efficient mobile application. Candidate should have experience designing, developing, testing and implementing mobile web-service driven apps in the Apple App Store and Android Market.Candidate will be experienced in more than one platform, have object oriented design experience and understanding of one or more major relational database management system. Candidate must have an exceptional sense of modern web and user experience design, graphics, layout, transitions and feedback on the mobile platforms. Knowledge of 508 and mastery of variations on mobile platforms (I/O, display, audio, libraries, etc.) are a must. The mobile developer must possess excellent written communication skills as they will be called upon to write detailed technical specifications. The Mobile Developer will be able to weigh customer needs against technical best practices. Thus, the Mobile Developer must possess excellent verbal communication skills and ability to interact with users at all levels within the organization.Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Candidate must have the ability to work in the United States without a current or future need for visa sponsorship.Interested in learning more about IBM? Check out the IBM Global Careers newsletter. PSHJ DCHJ Q4FC. Required High School Diploma/GED At least 3 years experience in mobile application development (iPhone, Android, iPad, Windows Mobile) At least 2 years experience in of published examples of mobile applications on the App store or the Android market At least 3 years experience in iOS - Strong OO design and programming skills At least 3 years experience in or familiar with iOS SDK At least 3 years experience in in Android - Strong OO design and programming skills in Java J2EE/J2ME At least 3 years experience in or familiar with Android SDK At least 2 years experience in or familiar with Eclipse; Familiar with Worklight Studio U.S. citizenship required English: Intermediate Preferred Bachelor's Degree English : Fluent",
            "name": "Job description",
            "type": "text"
        }
    ]
}


