{
    "id": "GBS-0713570",
    "label": "Network Engineer",
    "parts": [
        {
            "data": "IBM is seeking a Network Engineer to support projects and customers at an IBM Data Center. This position focuses on managing and maintaining network devices and applications such as: • Cisco Catalyst and Nexus Switches • Cisco and F5 Load Balancers • IBM Tivoli Network Configuration Manager • IBM Tivoli Network Manager Internet Protocol (IP) Edition Engineers are not expected to know all the listed applications, but experience with the listed applications, or comparable applications, is desired. Position will require day-to-day operations of the enterprise network solutions as well as assisting team members with additional system and network applications. Responsibilities will be to maintain all aspects of the solution, to include on-going documentation, maintenance, training of operations staff, and continuing optimization of the suite to provide robust network services. Role may require off hours support, occasionally. Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel. (2252) PSHJ Required High School Diploma/GED At least 2 years experience in operating and maintaining system network solutions. At least 2 years experience in administering networks in a data center environment. At least 1 year experience in Cisco switches. At least 1 year experience in troubleshooting network issues in a large environment. At least 2 years experience in creating formal documentation for systems administration, operations, and maintenance. At least 3 years experience in strong teamworking skills and effectively communicating (both orally and written) to various audiences. U.S. citizenship required English: Fluent Preferred Bachelor's Degree At least 1 year experience in Cisco Nexus 10 Gigabit switching and routing and Fibre Channel over Ethernet (FCoE) At least 1 year experience in load balancer configuration and administration. Basic knowledge in formal processes for change and release management Industry systems certifications. Security clearance of Minimum Background Investigation (MBI) Certified in Information Technology Infrastructure Library (ITIL) Certified in Cisco Certified Network Associate (CCNA)/Cisco Certified Networking Professional (CCNP) ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
