{
    "id": "GBS-0729136",
    "label": "WebSphere Commerce Developer",
    "lastbuild": "2015-03-10T10:54:40.913Z",
    "parts": [
        {
            "data": "Job description The WebSphere Commerce Developer is responsible for defining and implementing the technical architecture of the WebSphere Commerce solution and defining the integrations necessary to enable the functional scope of Commerce. In addition, the WebSphere Commerce Developer will lead technical discussions with clients and other team members to define the interface touch points within the solution footprint as well as with other systems involved in the end-state solution for Commerce data model. The WebSphere Commerce Developer will also lead the implementation of the Commerce solution and development of custom tables/integrations/extensions as necessary. They will conduct technical reviews of designs, complete code reviews prior to testing, conduct technical reviews of test plans and test coverage for Commerce solution areas, lead test execution activities, lead defect triage/resolution activities during all test phases, support production readiness evaluation, and ensure final solution build is deployed and configured correctly in Production.Selected candidates may not need to travel for all projects outside of their metro area. However, all candidates must be able and willing to travel based on assigned project demand. Travel requirements may vary but could be up to 100%. Candidates are not able to refuse project based on travel Stay connected by subscribing to the IBMjobs blog for career insights, news and latest job opportunities.IBM Global Business Services: Join a Leader. Consult with us.Required High School Diploma/GED At least 2 years experience in designing, developing, configuring, testing and implementing WebSphere Commerce components At least 2 years experience in analyzing customer e-Commerce requirements to deliver WebSphere Commerce solutions At least 2 years experience in using the WebSphere Commerce Development and WebSphere Studio Application Developer (WSAD)/Commerce Toolkit; using other software development toolkits At least 2 years experience in using integrated development environments At least 2 years experience in integrating WebSphere Commerce with other IBM Commerce solutions (example, Sterling Order Management Software (OMS) At least 2 years experience in leading a distributed development team through the lifecycle deployment of a WebSphere Commerce solution At least 2 years experience in developing functional and technical WebSphere Commerce documentation Readiness to travel Up to 4 days a week (home on weekends-based on project requirements) U.S. citizenship required English: Basic knowledge Preferred Bachelor's Degree At least 6 years experience in designing, developing, configuring, testing and implementing WebSphere Commerce components At least 6 years experience in analyzing customer e-Commerce requirements to deliver WebSphere Commerce solutions At least 6 years experience in using the WebSphere Commerce Development and WebSphere Studio Application Developer (WSAD)/Commerce Toolkit; using other software development toolkits At least 6 years experience in using integrated development environments At least 6 years experience in integrating WebSphere Commerce with other IBM Commerce solutions (example, Sterling Order Management Software (OMS) At least 6 years experience in leading a distributed development team through the lifecycle deployment of a WebSphere Commerce solution At least 6 years experience in developing functional and technical WebSphere Commerce documentation English : Intermediate",
            "name": "Job description",
            "type": "text"
        }
    ]
}


