{
    "id": "GTS-0708822",
    "label": "SoftLayer Quality Engineer - Datawarehouse ",
    "parts": [
        {
            "data": "Empowered. Innovative. Inspiring. Creative. Intense. These are all words we use to describe life at SoftLayer. We are looking for a Data Warehouse Test Engineer who is responsible for the validation of Data Warehouse (DW) Data Marts and Applications. This position will work closely with the ETL Development team and Business Owners during the implementation and delivery of projects from requirements inception through production release. The ideal candidate will be well-versed in database testing with excellent command of SQL (Oracle 10,11g), data warehousing methodologies (e.g. Kimball), ETL practices and end-to-end data validation and quality assurance across the DW lifecycle. If you are a talented professional who seeks responsibility, thrives when empowered, and understands the importance of personal accountability, then we would like to talk with you. As a member of the SoftLayer team, you have the opportunity to directly impact the continued success of the company. We strive to make SoftLayer a place where you want to be – a place where you are proud to work and where you are motivated to produce the best results possible. PRIMARY RESPONSIBILITIES: • Design and implement automated test frameworks that ensure quality without sacrificing speed to market. • Develop test plans, test scenarios and test strategies, reusable test cases and performs data analysis and creation of test data for various ETL data warehouse components. • Perform manual and automation execution of test scripts, analyze and thoroughly document defects identified during test execution. • Think out-of-the-box and consider all possible ways a product could fail and build automation to support testing and quality assurance in a creative manner. QUALIFICATIONS: • 8+ years’ experience in quality engineering and software test development. • Thorough understanding of software testing and passionate about delivering high quality software. • Extensive experience with RDBMS for Data warehouse testing of ETL Applications, OBIEE & DW reports. • Experience in writing and executing SQL Queries to validate the databases tables, perform data completeness, correctness, data transformation and data quality testing for source to target mapping within the data warehouse. • Technical knowledge and understanding of Data Warehousing concepts, ETL and BI processes • Software design verification and test development instincts and creativity. • Must have proven analytical and effective problem solving skills, for acquiring a thorough understanding of the functional and technical design of the application(s) being supported • Any data conversion / Migration testing experience is a plus EDUCATION: • BS in Computer Science or similar engineering degree preferred. Required High School Diploma/GED At least 8 years experience in Business Intelligence Testing English: Fluent Preferred Bachelor's Degree At least 10 years experience in Business Intelligence Testing",
            "name": "Job description",
            "type": "text"
        }
    ]
}
