{
    "id": "GTS-0734016",
    "label": "SoftLayer MySQL Database Administrator ",
    "parts": [
        {
            "data": "Empowered. Innovative. Inspiring. Creative. Intense. These are all words we use to describe life at SoftLayer. The Operations group is challenged with solving complex problems that will advance our business to the next level. We build the most innovative systems in the industry using the latest technology to deliver creative solutions for our customers. We are searching for an ambitious MySQL DBA that is looking to take his or her skills to the next level by joining the Managed Services group of Softlayer. In this role, you'll work with a small team to deploy complex server deployments with a high emphasis on security, availability, and scalability. Essential Duties: • Deploy and maintain complex MySQL environments. • Work with customers and vendors to deploy MySQL. • Assist with change management and documentation of customer environments. • Work with dedicated team to ensure success of select customer group. • Ensure customer uptime through precise monitoring implementations, good change management and incorporation of best practices. • Establish a great relationship with the customer by displaying expertise and offering best practices. • Install, configure, and maintain MySQL in customer environments. • Develop automation tools surrounding monitoring, performance and capacity planning. • Participate in a 24x7 on-call rotation and night deployments, as needed. • Ability to motivate themselves and their team to do what is right by the customer • Ability to troubleshoot and performance tune both Linux and MySQL. Requirements: • Minimum of 2 to 4 years of MySQL administration. • Intermediate knowledge of LAMP and WAMP environments. • Experience configuring and troubleshooting replication. • Intermediate knowledge of MySQL performance tuning. • Intermediate knowledge of SQL (joins, sub-queries, etc...) • Experience with database backups and restores • Excellent written and verbal communication skills. • Ensure MySQL servers run at optimal health; performance troubleshooting as necessary (resource profiling, index management, disk I/O, CPU, identify bottlenecks, etc...). • Experience with LVM, MySQL Cluster, Chef, and Percona server and toolkit a PLUS • Experience with InnoDB, MyISAM, and other storage engines. • PHP/Perl and Bash scripting experience required. • Excellent customer services skills. • Ability to manage priorities in a fast paced changing environment. • Previous 24x7 experience a plus. Education • MySQL CMA certification is highly desired. • MySQL DBA and Developer certification a strong plus. • A four year degree is preferred. Company Overview Headquartered in Dallas, Texas, SoftLayer delivers world-class, on-demand virtual data center services on a global basis from facilities located in Dallas, TX; Seattle, WA; and Washington, DC. SoftLayer integrates all facets of IT to innovate industry-leading solutions that are fully automated. This empowers customers with complete control, security, scalability, and ease-of-management for their IT environment. SoftLayer’s leading proprietary management capabilities include the industry’s first Network-Within-a-Network topology for true out-of-band access and the company’s leading Customer Portal and Open API, providing full remote access of all product and service management options. Specialties Hosting, IaaS, Data Center, datacenter, network, servers, facebook, applications, cloud computing, cloud storage, managed hosting, managed servers, managed services, PaaS, infrastructure, scalability Required High School Diploma/GED At least 2 years experience in MySQL administration Basic knowledge in LAMP and WAMP environments English: Fluent Preferred Bachelor's Degree At least 4 years experience in MySQL administration At least 6 months experience in LAMP and WAMP environments Certified in MySQL CMA, MySQL DBA, MySQL Developer ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
