{
    "id": "S_D-0729196",
    "label": "Endpoint & Mobility Software Sales Representative - Great Lakes & South ",
    "parts": [
        {
            "data": "The Endpoint and Mobility Sales Specialist will lead all sales activities in the Great Lakes Region and act as the focal point to the client for the sales of IBM Endpoint Management and Mobility. The position will entail managing key relationships, understanding the client's organization and culture, and developing strategic plans to address both IT and Line-of-Business organizations. The Sales Specialist will leverage subject matter experts, executives, and thought-leaders to provide value to the client and will build relationships with senior client executives while earning a reputation as a trusted business adviser. The successful candidate will join a dedicated sales team targeting company’s IT Operations, Business Units and Security Management. (Principally Systems Management, Mobility and Security Management). A demonstrated level of business acumen as it applies to the client's business is a critical requirement. This position covers the Ohio, Michigan, Indiana, West Virginia and Kentucky territory. Responsibilities: • Work with the existing IBM Security Sales Team to identify, qualify and close new business sales opportunities with enterprise accounts in the region . • Exceed the sales plan and business objectives by successfully selling IBM Endpoint Management and Mobility solution and services into the region. • Partner with the IBM Security Sales Team to leverage their account penetration and existing relationships by expanding the overall IBM solution to include the IBM Endpoint and Mobility Platform . • Partner with the IBM Sales Team to manage the commercial relationship with the prospect during the full sales cycle; actively lead the resolution of customer issues to ensure their satisfaction and a successful outcome to the sale. • Engage technical resources, as appropriate, to ensure the company overcomes any technical objections in the sales cycle. • Develop trusted relationships at a senior management level in enterprise accounts and develop and maintain their confidence by understanding the role of a IBM Endpoint and Mobility Platform in helping them to achieve their business objectives through an enterprise mobile strategy. • Develop and maintain relationships internally; ensure a high level of teamwork and collaboration with support staff and other functions within the company. • Coordinate and deliver timely, accurate and quality information to meet sales goals; track and forecast revenue in line with company format and procedures. Key Attributes: • Successful track-record in building pipeline, growing a territory and managing multiple sales related activities • Works well in a team matrix leveraging extended team resources and managing resources through each deal • Consultative sales approach, with the ability to work with a team Required At least 3 years experience in software sales, tech sales or pre-sales At least 2 years experience in selling high end enterprise mobile software solutions into large organizations Readiness to travel 25% travel annually English: Fluent Preferred Master's Degree ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
