{
    "id": "S_D-0732659",
    "label": "Security Web Fraud Inside Software Sales Representative - Trusteer",
    "parts": [
        {
            "data": "Trusteer, an IBM company, is the global leader in endpoint cybercrime prevention. Trusteer products stop the root cause of data breaches and fraud losses: the compromise of employee and customer endpoints by advanced malware and phishing attacks. We are seeking quota-carrying candidates for a senior sales position. Responsibilities will consist of selling complex solutions to online and mobile banking application owners, line of business leaders, and Chief and Information Security Officers. Sellers will join a successful team that sells solutions to solve major fraud, brand management, and compliance challenges for financial institutions. These online and mobile security solutions are in high demand throughout the financial services industry. As a Security Software Sales Representative, you are responsible for developing solutions address the client's business needs. You will be responsible for opportunity identification, forecasting, sales execution and customer satisfaction. You will work to create solutions which are tailored to client’s business needs and integrate the IBM capabilities in a way that is valued by the customer and superior to the competition. You are also responsible for developing and maintaining demonstrated relationships with executives and influencers in the IT and Line-of-Business organizations in these accounts. You will navigate IBM to identify and acquire critical resources needed to develop the best solution for the client. Further Responsibilities: - Target the largest financial institutions in your territory and develop demonstrated knowledge of these accounts - Introduce Trusteer solutions to key buyers/influencers and establish trusted relationships - Manage complex sales process, from initial meeting through procurement and contract signing - Explain IBM/Trusteer value proposition through presentation, email, and verbal communications - Be fluent in core IBM solution capabilities and competitive environment - Track and report on all activities though the sales automation system - Manage pipeline and provide reliable forecast Key Attributes: - Trusted relationships with line of business, online/mobile banking, and information security executives - Prospecting, qualifying, closing and managing skills - Presentation and communication skills with the ability to influence, persuade, and negotiate at all levels to achieve win-win situations - Experience selling within matrix environments - Ability to work closely with executive contacts &PMON Required At least 3 years experience in Financial Services Line of Business Sales At least 2 years experience in and executive relationships in one or more financial segments: retail and business banking, private wealth management, investment banking, brokerage, processor/merchant acquirer. Readiness to travel 25% travel annually English: Fluent Preferred Bachelor's Degree At least 2 years experience in selling complex solutions to online and mobile banking application owners and/or line of business leaders At least 3 years experience in fraud solution sales",
            "name": "Job description",
            "type": "text"
        }
    ]
}
