{
    "id": "STG-0732261",
    "label": "Unit Process & Patterning Engineering Professional ",
    "parts": [
        {
            "data": "IBM’s Semiconductor Research and Development (SRDC) is seeking an Engineer / Scientist in the area of advanced process development. The hired candidate will have significant experience in one or more of the following areas: lithography process development, reactive ion etch, film deposition, wet chemical etch, Chemical-Mechanical Polish (CMP), epitaxy growth, Design-Technology Co-optimization (DTCO), metrology (inspection, CDSEM, scatterometry), and lithography / process modeling. Some of the job responsibilities include the development of patterning, metrology, inspection and unit process processes targeting 10nm and below technologies. Specifically, the patterning and metrology positions will involve: the development of self-aligned multiple patterning, Extreme Ultraviolet (EUV) lithography, directed self-assembly; the development of etch technology for advanced device and BEOL technologies; and the development of associated metrology and inspection technologies. Specifically, the unit process positions will involve: the development of new epitaxy growth processes, Rapid-Thermal-Anneals / Junctions processes, wet cleans,. The position requires interaction with cross-functional working teams that include integration engineers, design/layout engineers, materials and process development teams, and computational technology engineers. The hired candidate must possess fundamental understanding of underlying chemistry and/or physics of the target area. Candidate should have demonstrated written and verbal communication skills as well as the ability to articulate difficult concepts to an audience with diverse technical backgrounds. Required Bachelor's Degree At least 2 years experience in semiconductor science & technology Readiness to travel 10% travel annually Preferred Doctorate Degree in Engineering English : Fluent ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
