{
    "id": "STG-0711365",
    "label": "Senior Technical Sales Specialist - Software Defined Infrastructure",
    "parts": [
        {
            "data": "Ready to change the way the world works? IBM Watson uses Cognitive Computing to tackle some of humanity's most challenging problems - like revolutionizing how doctors research cancer or transforming how businesses engage with their customers. We have an exciting opportunity for a Security Services Specialist with an entry security focus into Identity & Access management and Information Technology (IT) Controls.Join the growing Watson Security & Risk Assurance team. Join our Watson team as we support IBM’s strategic focus on Watson, Cloud and Security. This position focuses on security engineering, entry level initially for access management and Information Technology (IT) Controls for the Watson environments. Individuals will be responsible to secure the environment, manage risk, and meet regulatory compliance for the Watson as a Service (WaaS) solutions by working collaboratively across the Watson team. Capabilities: Manage user accounts and tooling Validate controls Recommend fixes for control gaps Support mitigation of control gaps Learn and support as backup on: Security intelligence/Security Information Event Management (SIEM) tools Securing operating systems such as Windows and LINUX Intrusion prevention processes and tools Ethical hacking approaches/tools/scripts Knowledge of: Industry accepted security frameworks Compliance in regulated industries such as healthcare, financial and US Public Sector industries Ability to work with a group of peers, planning, achievement of goals, work completion, communication and collaboration skills Example Responsibilities Include: Ensure compliance with Watson security policy and standards Integrate, test, implement and manage various information security tools with access managment Collaborate with Infrastructure system administrators and Watson product teams to identify and manage security risks Provide security recommendations on mitigating control gaps Document the agreed upon security solutions Assess security controls. Back fill other Watson Security & Risk Assurance team members as may be needed We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming industries, society and even the workplace. New roles are being created that never existed before to meet the demands of this transformation. And IBM Watson is now looking for talent to usher in the next era of cognitive computing. Embark on the journey with us at IBM Watson. Required High School Diploma/GED At least 1 year experience in apply security risk management covering threat analysis and vulnerability management At least 1 year experience in apply penetration testing techniques At least 1 year experience in apply security practices English: Fluent Preferred Bachelor's Degree in Information Technology At least 3 years experience in apply security risk management covering threat analysis and vulnerability management At least 3 years experience in apply penetration testing techniques At least 3 years experience in apply security practices",
            "name": "Job description",
            "type": "text"
        }
    ]
}