{
    "id": "SWG-0726003",
    "label": "User Interface (UI) Engineer/Front End Developer - Silverpop",
    "lastbuild": "2015-03-10T11:06:40.913Z",
    "parts": [
        {
            "data": "Job description Silverpop, a leading provider of permission based email solutions and services, is experiencing tremendous growth and is hiring User Interface (UI) Web Developers to be responsible for creating world-class user interfaces across our products for a wide variety of customers. We are looking for driven UI developers who love pushing the envelope of UI development. Do you strive to create rich user experiences with clean UI layout and responsive performance? Do you like engineering with UI technologies like Javascript, DHTML, AngularJS and/or Dojo? Are you a creative problem solver who can look at a UI and say that’s good, but here are some ways to make it even better? Do you take the reins on a project and do what it takes to get it done? If so, Silverpop would like to chat with you. This UI developer would work with our UI architect, the User Experience (UX) team, and various development teams to come up with useable and innovative interfaces to serve our customer.Responsibilities Include: Contribute, innovate, and be driven about bringing usability and beauty to the products. Work closely with product managers, UX designers, back-end and test engineers to implement elegant and easy to use front-end solutions. Embrace and promote best practices in order to create maintainable, high performance web applications.Must be able to work with multidisciplinary groups of peers on many projects.Maintain and extend existing product UI.Qualifications:Demonstrated experience as a Software Developer. Demonstrated understanding of web technologies (e.g. Javascript, DHTML, Cascading Style Sheets (CSS), Representational State Transfer (REST), JSON) and experience in creating reusable UI components.Knowledge of AngularJS, Bootstrap, Node, Dojo, jQuery or similar libraries is a huge bonus!. Demonstrated Ability to unit testing.Cross browser development experience with Javascript and CSS. Demonstrated knowledge of user interface and information design processes and methodology. Demonstrated interpersonal and communication skills Portfolio of designs, explaining your approach and problems solved. Required High School Diploma/GED At least 6 months experience in software developer •web technologies Readiness to travel 10% travel annually English: Fluent Preferred Bachelor's Degree in Information Technology At least 3 years experience in software developer web technologies At least 2 years experience in AngularJS, Bootstrap, Node, Dojo, jQuery or similar libraries",
            "name": "Job description",
            "type": "text"
        }
    ]
}


