{
    "id": "SWG-0724822",
    "label": "Software Developer",
    "lastbuild": "2015-03-10T11:04:40.913Z",
    "parts": [
        {
            "data": "Job description Opportunity is for a financial payments software developer/tester position for the design, implementation and testing of products in the Payment Solutions space. Seeking a self-motivated and self-directed candidate with proven track record of commitment to quality and schedule. At least 4 years experience preferred on software development projects using IBM tools such as Rational Team Concert (RTC), Rational Quality Manager (RQM), Rational Application Developer (RAD), etc. and IBM middleware using WebSphere Application Server (WAS), DB2, etc.. Ten years experience developing and testing payments processing software is required and experience with both IBM Payments Director and IBM Financial Transaction Manager products is preferred. As an IBM Software Developer/Tester, you'll use the latest tools and technologies available to deliver state-of-the-art software. You'll be responsible for ensuring that company software components are expertly designed, tested, debugged, verified, and ready for integration into IBM's best-of-breed solutions that help organizations improve their business outcomes in the global marketplace.As an IBM Software Developer, you'll use the latest tools and technologies available to deliver state-of-the-art software. You'll be responsible for ensuring that company software components are expertly designed, tested, debugged, verified, and ready for integration into IBM's best-of-breed solutions that help organizations improve their business outcomes in the global marketplace.Location is IBM Charlotte. Entire team is located onsite in Charlotte, NC. Candidate must be willing to be located at IBM Charlotte Monday through Friday, working remotely is not an option. Moving and relocation expense reimbursement is not offered for this position. Required At least 10 years experience in payments solutions software development and test Readiness to travel 10% travel annually English: Fluent Preferred At least 4 years experience in software development projects using IBM tools",
            "name": "Job description",
            "type": "text"
        }
    ]
}


