{
    "id": "SWG-0694317",
    "label": "Watson Machine Learning Lead Visualization Researcher - Internship",
    "parts": [
        {
            "data": "Ready to change the way the world works? IBM Watson uses Cognitive Computing to tackle some of humanity's most challenging problems - like revolutionizing how doctors research cancer or transforming how businesses engage with their customers. We have many exciting opportunities for Watson Machine Learning Visualization Researchers. Are you interested in combining your background in computer imaging/visualization with cutting edge data analytics? IBM Watson has many opportunities open for you! IBM Watson (http://www.ibm.com/smarterplanet/us/en/ibmwatson) is seeking demonstrated researchers, with background in machine learning and computer vision, to work on developing image/video understanding technologies for practical and novel public safety applications. We expect the candidates to be proven in conducting cutting edge research, and alsopassionate about turning research into high impact products and services. We encourage researchers to establish leadership in the research community, and maintain active research collaborations with top universities in the US.The IBM Watson Group is looking for candidates in machine learning and data science for a new long-term research project on combining clinical and imaging data for enhanced clinical decision making in cardiology and radiology. We are seeking top talents to enhance both of these the teams. Preferred skills include:Demonstrated publications in top machine learning or computer vision conferences & journals Demonstrated knowledge in math, optimization, and statistical inference Demonstrated problem solving skills, with a desire for quality and engineering excellence Demonstrated knowledge developing and debugging in C/C++ Experience with image classification, object recognition, or visual scene parsing Hands-on experience in implementing large-scale learning algorithms and systems Experience with real-time computer vision systems Experience with Medical Imaging Analysis Experience in advanced statistical modeling Bachelor's Degree At least 3 years experience in Computer Visualization At least 3 years experience in Machine Learning At least 3 years experience in Text Extraction and Analytics At least 3 years experience in Java or C++ Readiness to travel 10% travel annually English: Fluent Preferred Doctorate Degree At least 5 years experience in Computer Visualization At least 5 years experience in Machine Learning At least 5 years experience in Text Extraction and Analytics At least 5 years experience in Java or C++",
            "name": "Job description",
            "type": "text"
        }
    ]
}
