{
    "id": "SWG-0726686",
    "label": "Watson Cloud Developer ",
    "lastbuild": "2015-03-10T13:25:40.913Z",
    "parts": [
        {
            "data": "Job description Want to become a cognitive computing ninja? Cognitive computing is poised to systematically transform how organizations think, act, and operate. Be part of the Watson Implementations organization, which will deliver business value from cognitive solutions to our clients at an unprecedented rate and pace leveraging the Watson Developer Cloud! We’re tackling some of humanity's most challenging problems - like revolutionizing how doctors research cancer or transforming how businesses engage with their customers.We are looking for a hands on software developer to join the Watson Developer Cloud enablement team. Candidates will be conversant with Cloud technologies and have familiarity with Platform as a Service (PaaS) concepts and implementations, having developed a number of services for cloud deployment. Cloud Engineers drive demonstrated collaboration with other teams and clients and implement cognitive solutions that bring quick business value.Candidates will be learning new technologies and mastering the cognitive computing landscape. Candidates who relish driven work environments, have demonstrated collaboration skills and are fearless in the face of new and nascent technologies will be a good fit. The ability to work through complex and sometimes time consuming technical roadblocks is a must. Knowledge of data integration architectures, design principles, front end development and user experience, application integration and large scale systems is a plus. The team will be ultimately responsible for the architecture, development and delivery of these cognitive applications and services for clients.Candidate will have demonstrated knowledge in areas such as below gained through experience or significant academic study: Java server/system programming. Ruby, Node.js, Python. Natural Language Processing (experience in a multilingual setting is a bonus) or Linguistics Advanced and Semantic Search (experience with different indexing and retrieval technologies such as Indri or Lucene a plus) Machine Learning (Statistical pattern recognition, semi-supervised learning, active learning, demonstrated learning/neural nets, bagging and boosting etc.). Data Mining Knowledge Representation and reasoning (relationship representation & extraction, ontology, lexicon and related technologies) Automatic knowledge acquisition from text such as semi/unsupervised ontology induction Experience with dialog management, automatic speech recognition, document summarization and machine translation system Do you have a passion for designing and implementing game changing solutions? Do you strive to work on complex problems and break them down into manageable tasks with predictable delivery schedules? Do you relish developing services for the cloud? If so, you’re just the person for us. Come join us as we lead into the new era of computing Required Bachelor's Degree  At least 3 years experience in java programming  At least 3 years experience in two or more areas such as: human language, cognition, mathematics, computer programming, solving complex problems, machine learning, artificial intelligence At least 2 years experience in python, ruby or other scripting language Readiness to travel 10% travel annually English: Fluent Preferred Master's Degree in Information Technology At least 10 years experience in java programming At least 10 years experience in two or more areas such as: human language, cognition, mathematics, computer programming, solving complex problems, machine learning, artificial intelligence At least 5 years experience in python, ruby or other scripting language",
            "name": "Job description",
            "type": "text"
        }
    ]
}


