{
    "id": "SWG-0726729",
    "label": "Software Developer",
    "lastbuild": "2015-03-10T11:59:40.913Z",
    "parts": [
        {
            "data": "Job description Java Developer – Entity Analytics IBM Identity Insight is looking for a Java developer to design and develop analytical and configuration interfaces for IBM’s Identity Insight suite of products. Identity Insight uses exciting technology to provide a real-time entity analytics (i.e. entity resolution, relationship detection, alert generation, and transactional analysis) to intelligence groups, government agencies, police departments, health services organizations, and financial industries. This cutting-edge technology is constantly evolving, and cloud technology combined with real-time analytics promise to take Identity Insight to the next level.Applicants must possess Java development skills, relational database skills, and Object Oriented (OO) design knowledge. Cloud development and .Net experience are a big plus.Cognos, Service Oriented Architecture (SOA) development and Java script tool (DOJO) front-end development will also be considered. Must be able to work in a team environment (often with geographically distributed team members) and have demonstrated communication and technical writing skills.Required Skills Java development and design skills Relational database knowledge Creative problem solving System and unit testing Demonstrated communication and collaboration skills Performance development Fluent English Comfortable in Unix environments Ability to learn and adapt to rapidly changing environments Bachelor's Degree in Information Technology, Engineering, Mathematics or equivalent Preferred Skills Cloud Development .NET/C# experience EXtensible Markup Language (XML) and EXtensible Stylesheet Language (XSLT) Java script tool (DOJO) Cognos development Multi-tier application development experience Demonstrated technical writing skills Ready to change the way the world works? This is your chance to develop innovative new technology products, as well as your career, with the world's second largest software-maker. Hone your expertise alongside fellow talented professionals, where you'll develop some of the most exciting software solutions on the market. At IBM, we're strongly committed to the advancement of open Internet standards and applications as well. As an IBM Software Developer, you'll use the latest tools and technologies available to deliver state-of-the-art software. You'll be responsible for ensuring that company software components are expertly designed, tested, debugged, verified, and ready for integration into IBM's best-of-breed solutions that help organizations improve their business outcomes in the global marketplace. Required High School Diploma/GED At least 3 years experience in JAVA/J2EE developement  At least 3 years experience in relational database, database software (DB2) and/or Oracle and/or relational database (MS SQL) and/or Informix U.S. citizenship required English: Fluent Preferred Bachelor's Degree  At least 1 year experience in cloud development At least 1 year experience in EXtensible Markup Language (XML) and EXtensible Stylesheet Language (XSLT) At least 1 year experience in Javascript tool (DOJO) development environment At least 1 year experience in .NET/C# experience At least 1 year experience in Cognos development",
            "name": "Job description",
            "type": "text"
        }
    ]
}


