{
    "id": "SWG-0732307",
    "label": "Account Director - Silverpop ",
    "parts": [
        {
            "data": "Summary/Overview: The Account Director (AD) – Professional Services engages with a portfolio of enterprise clients across multiple verticals, usually in quarterly or annual intervals, to help identify, expose and execute opportunities to enhance their marketing practice and most optimally utilize their relationship with Silverpop. These responsibilities require: • An understanding of Silverpop’s products, services and partner solutions. • Skills in behavioral marketing, digital marketing channels, best practices and brand strategy. • Demonstrated consulting skills to distill complex business requirements down to the essential project/technical requirements • Experienced Program Management skills to orchestrate activities across internal and external organizational units to drive time to market and high-quality results. • Demonstrated leadership skills and an ability to effectively manage cross-functional, matrixed organizations made up of Silverpop and partner personnel. • Analytical proficiency that enables quantitative and qualitative measurement of validity of proposed strategies and financial impact. The AD operates in both a marketing strategy and business strategy capacity to cultivate and grow the relationship with Silverpop and increase overall success. This role is responsible for leading consultative engagements that define the client’s business goals, identify areas of opportunity, scope considered projects and consult on delivery in order to ensure optimal marketing success while maximizing ROI. This role will develop a thorough understanding of the client’s marketing programs and business objectives, serving as an extension of the marketing organization. They will advocate on behalf of the customer and enable a truly strategic partnership with Silverpop. By managing to measurement, the AD will develop roadmaps for the assigned customers and quantify impact produced along the way. Additionally, the AD serves as the single point of contact into the Professional Services organization, incorporating and leveraging subject matter experts, Silverpop partners and other applicable resources where necessary. The AD will own responsibility for matrixed personnel, both internally and across the Silverpop partner ecosystem. Essential Duties and Responsibilities: • Provides product and subject matter expertise to clients and is responsible for growing and maintaining the quality of the Professional Services relationship. • Identifies and recommends marketing opportunities that draw upon best practices and align with clients’ corporate objectives. • Manages both internal and client-side teams against immediate short-term projects and/or campaigns, with an understanding of long-term planning requirements and ensured scalability. • Designs, produces and presents reviews and recommendations on a monthly, quarterly, annual and ad hoc basis. • Develops clients’ annual Silverpop plans based on short and long-term corporate objectives and strategies. • Identifies and develops opportunities to expand Silverpop’s participation in the client's business to generate optimal business solutions via additional products, services and/or partnerships. • Fosters peer growth and performance; delegates appropriate responsibilities to aligned team members, using performance management tools as a guide. • Develops and displays thorough, working knowledge of Silverpop products, services and partner solutions, including application of best industry practices. • Proactively manages client expectations and delivers exemplary client service. Meets or exceeds the client’s expectations of knowledge and professionalism. Escalates any issues that impact successful execution of the work before the client is negatively impacted. • Leverages client experiences to provide valuable insight across the organization to assist in improving processes and workflows. Required Bachelor's Degree At least 5 years experience in agency/marketing services-related experience in email marketing and/or marketing automation At least 3 years experience in Project Management, preferably in the Professional Services group of a software product, agency or consulting company At least 6 months experience in gathering business requirements and assimilating that information into Project Specifications or Statements of Work At least 1 year experience in various interactive marketing channels (email, RSS, SEM, social, micro-sites). Basic knowledge in web technologies (HTML, CSS, Web Forms, JavaScript, RSS, FTP, XML, APIs, Web Services) and database technologies Readiness to travel 25% travel annually English: Fluent Preferred Master's Degree in Information Technology At least 7 years experience in agency/marketing services-related experience in email marketing and/or marketing automation At least 5 years experience in Project Management, preferably in the Professional Services group of a software product, agency or consulting company At least 2 years experience in gathering business requirements and assimilating that information into Project Specifications or Statements of Work At least 2 years experience in various interactive marketing channels (email, RSS, SEM, social, micro-sites). At least 1 year experience in web technologies (HTML, CSS, Web Forms, JavaScript, RSS, FTP, XML, APIs, Web Services) and database technologies ",
            "name": "Job description",
            "type": "text"
        }
    ]
}
