{
    "id": "SWG-0727730",
    "label": "Watson Application Developer",
    "lastbuild": "2015-03-10T13:44:40.913Z",
    "parts": [
        {
            "data": "Job description Ready to change the way the world works? IBM Watson uses Cognitive Computing to tackle some of humanity's most challenging problems - like revolutionizing how doctors research cancer or transforming how businesses engage with their customers. We have an exciting opportunity for a Application Developer. This role is to build, deploy, and maintain the Open Source Intelligence platform for Watson Discovery Advisor 1.0.This platform will enable rapid deployment of Watson services to potential new client’s .Deliver the demonstrated Quality Assurance (QA) Jeopardy! Challenge system for client use. Project requires demonstrated analysis of system performance phases including search, evidence scoring, and machine learning. Natural Language Processing Analysts evaluate system performance, and identify steps to drive enhancements.The role is part analyst and part developer. Analysts are required to function independently to dive deep into system components, identify areas for improvement, and devise solutions. Analysts are expected to drive test and evaluation of their solutions, and empirically identify follow on steps to implement continuous system improvement. Natural Language Processing is an explosively dynamic field; analysts must expect ambiguity, and demonstrate the ability to develop courses of action on the basis of data driven analysis. Candidate will work independently and have demonstrated analytical skills.We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming industries, society and even the workplace. New roles are being created that never existed before to meet the demands of this transformation. And IBM Watson is now looking for talent to usher in the next era of cognitive computing. Embark on the journey with us at IBM Watson. Required Bachelor's Degree Readiness to travel 50% travel annually U.S. citizenship required English: Fluent Preferred Master's Degree in Engineering At least 3 years experience in Natural Language Processing (NLP), Unstructured Text, Java, XML",
            "name": "Job description",
            "type": "text"
        }
    ]
}


