{
    "id": "SWG-0713148",
    "label": "Watson Java Developer",
    "lastbuild": "2015-03-10T11:32:40.913Z",
    "parts": [
        {
            "data": "Job description Ready to change the way the world works? IBM Watson uses Cognitive Computing to tackle some of humanity's most challenging problems - like revolutionizing how doctors research cancer or transforming how businesses engage with their customers. We have an exciting opportunity for a Watson Java Developer.We are looking for individuals well versed in Java Object Oriented (OO) programming with experience gained through professional or significant academic project research in the following: Systems development Distributed computing Linux development The IBM Watson offerings are based on the solution created by IBM Research and is a platform which is very different from most common software/hardware platforms in that it involves an uncommon and complex system of systems. The capability is based on Unstructured Information Management Architecture (UIMA) as an Open Source framework for deployment of a highly parallel, probabilistic infrastructure running across dozens of discrete Linux systems.Individuals interested in this job should have demonstrated technical ability as a developer, test engineer, services developer, system administrator or support engineer. Familiarity with the Linux operating environment and Linux scripting languages is also desirable.We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming industries, society and even the workplace. New roles are being created that never existed before to meet the demands of this transformation. And IBM Watson is now looking for talent to usher in the next era of cognitive computing. Embark on the journey with us at IBM Watson.Required Bachelor's Degree At least 2 years experience in Java Programming Basic knowledge in Natural Language Processing Basic knowledge in at least one of the following: Web 2.0 application development, JavaScript, Dojo, CSS, Ajax, Representational State Transfer(REST) Application Programming Interfacing's (API), DB2, XML Readiness to travel 10% travel annually English: Fluent Preferred At least 1 year experience in Natural Language Processing At least 1 year experience in at least one of the following: Web 2.0 application development, JavaScript, Dojo, CSS, Ajax, Representational State Transfer(REST) Application Programming Interfacing's (API), DB2, XML",
            "name": "Job description",
            "type": "text"
        }
    ]
}


